{
    "What is a variable?": "A variable is a named storage location in computer memory that holds a value.",
    "What is recursion?": "Recursion is a programming technique where a function calls itself to solve a problem by reducing it to smaller subproblems.",
    "What is the difference between a stack and a queue?": "A stack is a last-in, first-out (LIFO) data structure, while a queue is a first-in, first-out (FIFO) data structure.",
    "What is database normalization?": "Database normalization is the process of organizing data in a database to reduce redundancy and improve data integrity.",
    "What is the difference between SQL and NoSQL?": "SQL is a relational database management system (RDBMS) that uses structured query language, while NoSQL databases are non-relational and provide flexible data models.",
    "What is a primary key?": "A primary key is a unique identifier for a record in a database table.",
    "What is the difference between TCP and UDP?": "TCP (Transmission Control Protocol) is a reliable, connection-oriented protocol, while UDP (User Datagram Protocol) is a connectionless protocol.",
    "What is the difference between a web browser and a web server?": "A web browser is a client application used to access and view websites, while a web server is a software that serves web content to clients.",
    "What is the purpose of an API?": "An API (Application Programming Interface) is a set of rules and protocols that allows different software applications to communicate and interact with each other.",
    "What is version control?": "Version control is a system that records changes to files over time, allowing multiple people to collaborate on a project and track changes.",
    "What is the difference between Git and GitHub?": "Git is a distributed version control system, while GitHub is a web-based hosting service for Git repositories.",
    "What is cloud computing?": "Cloud computing refers to the delivery of computing services over the internet, including servers, storage, databases, networking, and software.",
    "What is a firewall?": "A firewall is a network security device that monitors and controls incoming and outgoing network traffic based on predetermined security rules.",
    "What is an API endpoint?": "An API endpoint is a specific URL or URI (Uniform Resource Identifier) that an API exposes to enable communication with other software applications.",
    "What is a data structure?": "A data structure is a way of organizing and storing data in a computer's memory to efficiently perform operations on that data.",
    "What is the difference between HTTP and HTTPS?": "HTTP (Hypertext Transfer Protocol) is an unsecured protocol, while HTTPS (Hypertext Transfer Protocol Secure) is a secure, encrypted version of HTTP.",
    "What is the role of a cache in computing?": "A cache is a hardware or software component that stores frequently accessed data to reduce access time and improve system performance.",
    "What is Big O notation?": "Big O notation is used in computer science to describe the performance or complexity of an algorithm in terms of the input size.",
    "What is a software bug?": "A software bug is an error, flaw, or fault in a computer program that causes it to behave unexpectedly or produce incorrect results.",
    "What is an IDE?": "An IDE (Integrated Development Environment) is a software application that provides comprehensive tools and features for software development.",
    "What is the role of a compiler?": "A compiler is a software program that translates source code written in a programming language into machine code that can be executed by a computer.",
    "What is a network protocol?": "A network protocol is a set of rules and conventions that govern the communication and exchange of data between devices on a computer network.",
    "What is cybersecurity?": "Cybersecurity refers to the practice of protecting computer systems, networks, and data from unauthorized access, attacks, and damage.",
    "What is the role of an operating system?": "An operating system is a software that manages computer hardware and software resources and provides common services for computer programs.",
    "What is the difference between static and dynamic typing?": "In static typing, variables are explicitly declared with their data types, while in dynamic typing, variables can hold values of any type during runtime.",
    "What is a virtual machine?": "A virtual machine is a software emulation of a physical computer that can run programs as if it were a separate physical machine.",
    "What is a distributed system?": "A distributed system is a collection of independent computers that appear to the users as a single, coherent system.",
    "What is the role of a network switch?": "A network switch is a networking device that connects devices on a computer network and facilitates the sharing of data.",
    "What is the difference between HTTP GET and POST methods?": "The HTTP GET method is used to retrieve data from a server, while the POST method is used to submit data to a server for processing.",
    "What is the difference between encryption and hashing?": "Encryption is a process of converting plaintext into ciphertext to protect data confidentiality, while hashing is a one-way process that transforms data into a fixed-length string.",
    "What is the role of a load balancer?": "A load balancer is a device or software that distributes network traffic across multiple servers to optimize resource utilization and ensure high availability.",
    "What is a kernel in an operating system?": "A kernel is the core component of an operating system that manages system resources, provides services, and acts as a bridge between software and hardware.",
    "What is the difference between horizontal and vertical scaling?": "Horizontal scaling involves adding more machines to distribute the load, while vertical scaling involves increasing the resources (CPU, memory) on a single machine.",
    "What is the role of a relational database?": "A relational database is a type of database that organizes data into tables with relationships between them, allowing for efficient querying and manipulation of data.",
    "What is the role of a web server?": "A web server is a software that delivers web content, such as HTML pages and files, to clients over the internet.",
    "What is the difference between a website and a web application?": "A website typically contains static content and is accessed through web browsers, while a web application is interactive and allows users to perform tasks and submit data.",
    "What is the role of a router in networking?": "A router is a networking device that forwards data packets between computer networks, enabling communication between devices on different networks.",
    "What is the difference between a compiler and an interpreter?": "A compiler translates the entire source code into machine code before execution, while an interpreter executes the code line by line without a separate compilation step.",
    "What is the role of a file system?": "A file system is a method for storing and organizing files on a storage medium, providing access, retrieval, and management of data.",
    "What is the difference between a process and a thread?": "A process is an instance of a program running on a computer, while a thread is a unit of execution within a process that can perform tasks concurrently.",
    "What is the role of a cache in web applications?": "A cache in web applications stores frequently accessed data to reduce server load, decrease response times, and improve overall performance.",
    "What is the difference between a bit and a byte?": "A bit is the basic unit of information in computing, representing a binary value (0 or 1), while a byte is a group of 8 bits.",
    "What is the role of an API gateway?": "An API gateway is a server that acts as an entry point for multiple APIs, providing centralized management, security, and routing of API requests.",
    "What is the difference between procedural and object-oriented programming?": "Procedural programming focuses on procedures or functions, while object-oriented programming emphasizes objects that encapsulate data and behavior.",
    "What is the role of a virtual private network (VPN)?": "A virtual private network (VPN) is a secure connection that allows users to access a private network over a public network, such as the internet.",
    "What is the difference between a compiler and an assembler?": "A compiler translates high-level source code into machine code, while an assembler converts assembly language code into machine code.",
    "What is the role of an application server?": "An application server is a server that hosts and provides software applications and services to client devices over a network.",
    "What is the difference between a router and a switch?": "A router connects multiple networks and routes data packets between them, while a switch connects devices within a network and forwards data packets to the intended recipient.",
    "What is the role of a cookie in web applications?": "A cookie is a small piece of data stored on a user's computer by a web browser, used to track user preferences, authentication, and session management.",
    "What is the difference between a monolithic and a microservices architecture?": "A monolithic architecture is a single, tightly coupled application, while a microservices architecture is composed of small, loosely coupled services that communicate with each other.",
    "What is the role of a distributed file system?": "A distributed file system is a file system that spans multiple machines and allows files to be shared and accessed across a network.",
    "What is the difference between synchronous and asynchronous communication?": "In synchronous communication, both sender and receiver are actively involved at the same time, while in asynchronous communication, the sender can continue with other tasks after sending the message.",
    "What is the role of a containerization platform like Docker?": "A containerization platform like Docker allows applications to be packaged with their dependencies into containers, providing isolation, portability, and scalability.",
    "What is the difference between a mutex and a semaphore?": "A mutex allows exclusive access to a shared resource by only one thread at a time, while a semaphore allows multiple threads to access a shared resource concurrently with a specified limit.",
    "What is the role of a reverse proxy?": "A reverse proxy is a server that sits between client devices and web servers, forwarding client requests to the appropriate server and providing load balancing and caching.",
    "What is the difference between a shell and a terminal?": "A shell is a command-line interface that interprets and executes commands, while a terminal is a hardware device or software application that provides access to a shell.",
    "What is the role of a content delivery network (CDN)?": "A content delivery network (CDN) is a distributed network of servers that delivers web content to users based on their geographical location, reducing latency and improving performance.",
    "What is the difference between artificial intelligence (AI) and machine learning (ML)?": "Artificial intelligence is a broad field of study focused on creating intelligent machines, while machine learning is a subset of AI that enables machines to learn from data and improve their performance without being explicitly programmed.",
    "What is the role of a virtual private server (VPS)?": "A virtual private server (VPS) is a virtual machine provided by a web hosting company that allows users to have dedicated resources and control over a portion of a physical server.",
    "What is the difference between a framework and a library?": "A framework provides a structure and a set of tools for developing applications, while a library provides pre-written code that can be used to perform specific tasks.",
    "What is the role of a content management system (CMS)?": "A content management system (CMS) is a software application that allows users to create, manage, and publish digital content on the web without requiring extensive technical knowledge.",
    "What is the difference between static and dynamic web pages?": "Static web pages are fixed and display the same content to all users, while dynamic web pages can change content based on user interactions or data from a database.",
    "What is the role of a network load balancer?": "A network load balancer distributes incoming network traffic across multiple servers to ensure high availability, fault tolerance, and optimal resource utilization.",
    "What is the difference between machine code and assembly language?": "Machine code is a binary representation of instructions executed directly by a computer's hardware, while assembly language is a human-readable representation of machine code instructions.",
    "What is the role of a content delivery server?": "A content delivery server is a server that caches and delivers web content, such as images, videos, and files, to users based on their geographic location and network conditions.",
    "What is the difference between a virtual machine and a container?": "A virtual machine emulates a complete operating system, while a container shares the host system's kernel and resources, providing lightweight isolation for applications.",
    "What is the role of a reverse DNS lookup?": "A reverse DNS lookup is the process of determining the domain name associated with an IP address, used for identifying the hostname of a given IP address.",
    "What is the difference between machine learning and deep learning?": "Machine learning focuses on algorithms that enable computers to learn from data and make predictions, while deep learning is a subset of machine learning that uses artificial neural networks with multiple layers to extract high-level features from data.",
    "What is the role of a VPN tunnel?": "A VPN tunnel establishes a secure, encrypted connection between two endpoints over a public network, allowing private data to be transmitted securely.",
    "What is the difference between a web server and an application server?": "A web server handles HTTP requests and serves web content, while an application server executes business logic and processes requests related to application-specific functionalities.",
    "What is the role of a root DNS server?": "A root DNS server is the highest level in the DNS hierarchy and provides information about the top-level domains (TLDs), directing DNS queries to the appropriate authoritative name servers.",
    "What is the difference between functional and imperative programming?": "Functional programming focuses on writing programs by composing pure functions, while imperative programming emphasizes sequencing statements and modifying program state.",
    "What is the role of a distributed database?": "A distributed database is a database that is spread across multiple computers or sites, providing scalability, fault tolerance, and high availability.",
    "What is the difference between machine learning and data mining?": "Machine learning focuses on developing algorithms that enable computers to learn from data and make predictions, while data mining is the process of extracting useful patterns and information from large datasets.",
    "What is the role of a virtualization hypervisor?": "A virtualization hypervisor is software that creates and manages virtual machines, allowing multiple operating systems to run on a single physical machine.",
    "What is the difference between cloud computing and edge computing?": "Cloud computing refers to the delivery of computing services over the internet, while edge computing brings computing resources closer to the source of data generation for faster processing and reduced latency.",
    "What is the role of an API key?": "An API key is a unique identifier used to authenticate and control access to an API, allowing developers to track and manage API usage.",
    "What is the difference between a web framework and a web server?": "A web framework is a software framework that provides a foundation for developing web applications, while a web server is responsible for handling HTTP requests and serving web content.",
    "What is the role of a database administrator (DBA)?": "A database administrator (DBA) is responsible for designing, implementing, and managing a database system, ensuring data integrity, security, and optimal performance.",
    "What is the difference between a shell script and a programming language?": "A shell script is a script written for the shell or command-line interface, while a programming language is a more general-purpose language used for building software applications.",
    "What is the role of a data warehouse?": "A data warehouse is a centralized repository that stores large amounts of structured and unstructured data, optimized for reporting, analysis, and decision-making.",
    "What is the difference between a cross-platform and a native application?": "A cross-platform application can run on multiple operating systems, while a native application is designed to run specifically on a particular operating system.",
}